Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.ai.prompt.user.chatUnavailable
source: Chat messages are sent directly and do not use a user prompt template.
ar: رسائل الدردشة تُرسل مباشرة ولا تستخدم قالب موجه المستخدم.
de: Chat-Nachrichten werden direkt gesendet und verwenden keine Benutzer-Prompt-Vorlage.
es: Los mensajes de chat se envían directamente y no usan una plantilla de prompt de usuario.
fr: Les messages de chat sont envoyés directement et n'utilisent pas de modèle de prompt utilisateur.
id: Pesan obrolan dikirim langsung dan tidak menggunakan template prompt pengguna.
it: I messaggi della chat vengono inviati direttamente e non utilizzano un modello di prompt utente.
ja: チャットメッセージは直接送信され、ユーザープロンプトテンプレートは使用しません。
ko: 채팅 메시지는 직접 전송되며 사용자 프롬프트 템플릿을 사용하지 않습니다.
nl: Chatberichten worden rechtstreeks verzonden en gebruiken geen gebruikersprompt-sjabloon.
pl: Wiadomości czatu są wysyłane bezpośrednio i nie używają szablonu promptu użytkownika.
pt_br: As mensagens de chat são enviadas diretamente e não usam um modelo de prompt do usuário.
ru: Сообщения чата отправляются напрямую и не используют шаблон пользовательского запроса.
tr: Sohbet mesajları doğrudan gönderilir ve bir kullanıcı istemi şablonu kullanmaz.
uk: Повідомлення чату надсилаються безпосередньо і не використовують шаблон запиту користувача.
vi: Tin nhắn trò chuyện được gửi trực tiếp và không sử dụng mẫu lời nhắc người dùng.
zh_hans: Chat 消息会直接发送，不使用用户提示词模板。
zh_hant: Chat 消息會直接發送，不使用用戶提示詞模板。

# settings.ai.provider
source: Provider
ar: المزود
de: Anbieter
es: Proveedor
fr: Fournisseur
id: Penyedia
ja: プロバイダ
ko: 제공업체
pl: Dostawca
pt_br: Provedor
ru: Провайдер
tr: Sağlayıcı
uk: Провайдер
vi: Nhà cung cấp
zh_hans: 服务商
zh_hant: 服務商

# settings.ai.provider.add
source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
id: Tambah
it: Aggiungi
ja: 追加
ko: 추가
nl: Toevoegen
pl: Dodaj
pt_br: Adicionar
ru: Добавить
tr: Ekle
uk: Додати
vi: Thêm
zh_hans: 新增
zh_hant: 新增

# settings.ai.provider.addHelp
source: Add provider
ar: إضافة مزود
de: Anbieter hinzufügen
es: Añadir proveedor
fr: Ajouter un fournisseur
id: Tambah penyedia
it: Aggiungi provider
ja: プロバイダを追加
ko: 제공업체 추가
nl: Provider toevoegen
pl: Dodaj dostawcę
pt_br: Adicionar provedor
ru: Добавить провайдера
tr: Sağlayıcı ekle
uk: Додати провайдера
vi: Thêm nhà cung cấp
zh_hans: 新增服务商
zh_hant: 新增服務商

# settings.ai.provider.delete
source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
id: Hapus
it: Elimina
ja: 削除
ko: 삭제
nl: Verwijderen
pl: Usuń
pt_br: Excluir
ru: Удалить
tr: Sil
uk: Видалити
vi: Xóa
zh_hans: 删除
zh_hant: 刪除

# settings.ai.provider.deleteConfirm.confirmFormat
source: Delete "%@"
ar: حذف "%@"
de: "%@" löschen
es: Eliminar "%@"
fr: Supprimer "%@"
id: Hapus "%@"
it: Elimina "%@"
ja: "%@" を削除
ko: "%@" 삭제
nl: "%@" verwijderen
pl: Usuń "%@"
pt_br: Excluir "%@"
ru: Удалить "%@"
tr: "%@" Sil
uk: Видалити "%@"
vi: Xóa "%@"
zh_hans: 删除「%@」
zh_hant: 刪除「%@」

# settings.ai.provider.deleteConfirm.messageFormat
source: "%@" will be removed permanently.
ar: سيتم إزالة "%@" بشكل دائم.
de: "%@" wird dauerhaft entfernt.
es: "%@" se eliminará permanentemente.
fr: "%@" sera supprimé définitivement.
id: "%@" akan dihapus secara permanen.
it: "%@" verrà rimosso permanentemente.
ja: "%@" は完全に削除されます。
ko: "%@"이(가) 영구적으로 제거됩니다.
nl: "%@" wordt permanent verwijderd.
pl: "%@" zostanie trwale usunięte.
pt_br: "%@" será removido permanentemente.
ru: "%@" будет удалён навсегда.
tr: "%@" kalıcı olarak kaldırılacak.
uk: "%@" буде видалено назавжди.
vi: "%@" sẽ bị xóa vĩnh viễn.
zh_hans: 删除「%@」后无法恢复。
zh_hant: 刪除「%@」後無法恢復。

# settings.ai.provider.deleteConfirm.title
source: Delete provider?
ar: حذف المزود؟
de: Anbieter löschen?
es: ¿Eliminar proveedor?
fr: Supprimer le fournisseur ?
id: Hapus penyedia?
it: Eliminare il provider?
ja: プロバイダを削除しますか？
ko: 제공업체를 삭제하시겠습니까?
nl: Provider verwijderen?
pl: Usunąć dostawcę?
pt_br: Excluir provedor?
ru: Удалить провайдера?
tr: Sağlayıcı silinsin mi?
uk: Видалити провайдера?
vi: Xóa nhà cung cấp?
zh_hans: 确认删除服务商
zh_hant: 確認刪除服務商

# settings.ai.provider.deleteHelp
source: Delete current provider
ar: حذف المزود الحالي
de: Aktuellen Anbieter löschen
es: Eliminar proveedor actual
fr: Supprimer le fournisseur actuel
id: Hapus penyedia saat ini
it: Elimina provider corrente
ja: 現在のプロバイダを削除
ko: 현재 제공업체 삭제
nl: Huidige provider verwijderen
pl: Usuń bieżącego dostawcę
pt_br: Excluir provedor atual
ru: Удалить текущего провайдера
tr: Geçerli sağlayıcıyı sil
uk: Видалити поточного провайдера
vi: Xóa nhà cung cấp hiện tại
zh_hans: 删除当前服务商
zh_hant: 刪除當前服務商

# settings.ai.provider.displayName
source: Display name
ar: اسم العرض
de: Anzeigename
es: Nombre para mostrar
fr: Nom d'affichage
id: Nama tampilan
it: Nome visualizzato
ja: 表示名
ko: 표시 이름
nl: Weergavenaam
pl: Nazwa wyświetlana
pt_br: Nome de exibição
ru: Отображаемое имя
tr: Görünen ad
uk: Відображувана назва
vi: Tên hiển thị
zh_hans: 显示名称
zh_hant: 顯示名稱

# settings.ai.provider.empty
source: No verified providers yet. Tap + on the right to add one.
ar: لا يوجد مزودون موثوقون بعد. اضغط + على اليمين لإضافة واحد.
de: Noch keine verifizierten Anbieter. Tippen Sie rechts auf +, um einen hinzuzufügen.
es: Aún no hay proveedores verificados. Toca + a la derecha para añadir uno.
fr: Aucun fournisseur vérifié pour l'instant. Appuyez sur + à droite pour en ajouter un.
id: Belum ada penyedia yang terverifikasi. Ketuk + di sebelah kanan untuk menambahkan.
it: Nessun provider verificato ancora. Tocca + a destra per aggiungerne uno.
ja: まだ確認済みのプロバイダはありません。右側の + をタップして追加してください。
ko: 아직 확인된 제공업체가 없습니다. 오른쪽의 +를 눌러 추가하세요.
nl: Nog geen geverifieerde providers. Tik op + aan de rechterkant om er een toe te voegen.
pl: Brak zweryfikowanych dostawców. Kliknij + po prawej, aby dodać.
pt_br: Nenhum provedor verificado ainda. Toque em + à direita para adicionar um.
ru: Проверенных провайдеров пока нет. Нажмите + справа, чтобы добавить.
tr: Henüz doğrulanmış sağlayıcı yok. Sağdaki +'ya dokunarak bir tane ekleyin.
uk: Ще немає підтверджених провайдерів. Натисніть + праворуч, щоб додати.
vi: Chưa có nhà cung cấp nào được xác minh. Nhấn + ở bên phải để thêm một nhà cung cấp.
zh_hans: 暂无已验证服务商，点击右侧 + 新增
zh_hant: 暫無已驗證服務商，點擊右側 + 新增

# settings.ai.provider.pickerLabel
source: Provider profile
ar: ملف تعريف المزود
de: Anbieterprofil
es: Perfil del proveedor
fr: Profil du fournisseur
id: Profil penyedia
it: Profilo provider
ja: プロバイダプロファイル
ko: 제공업체 프로필
nl: Providerprofiel
pl: Profil dostawcy
pt_br: Perfil do provedor
ru: Профиль провайдера
tr: Sağlayıcı profili
uk: Профіль провайдера
vi: Hồ sơ nhà cung cấp
zh_hans: 服务商配置
zh_hant: 服務商配置

# settings.ai.provider.sectionFooter
source: Testing calls the model-list endpoint. Local services (Ollama, LM Studio, …) may leave the API key blank. If the provider returns incomplete capability info, you can manually fix Chat / Embedding below.
ar: الاختبار يستدعي نقطة نهاية قائمة النماذج. الخدمات المحلية (Ollama، LM Studio، …) قد تترك مفتاح API فارغًا. إذا أرجع المزود معلومات قدرة غير كاملة، يمكنك إصلاح الدردشة / التضمين يدويًا أدناه.
de: Testen ruft den Modelllisten-Endpunkt auf. Lokale Dienste (Ollama, LM Studio, …) können das API-Schlüsselfeld leer lassen. Wenn der Anbieter unvollständige Fähigkeitsinformationen zurückgibt, können Sie Chat/Embedding unten manuell korrigieren.
es: La prueba llama al endpoint de lista de modelos. Los servicios locales (Ollama, LM Studio, …) pueden dejar la clave API en blanco. Si el proveedor devuelve información de capacidad incompleta, puedes corregir manualmente Chat / Embedding abajo.
fr: Le test appelle le point de terminaison de la liste des modèles. Les services locaux (Ollama, LM Studio, …) peuvent laisser la clé API vide. Si le fournisseur renvoie des informations de capacité incomplètes, vous pouvez corriger manuellement Chat / Embedding ci-dessous.
id: Pengujian memanggil titik akhir daftar model. Layanan lokal (Ollama, LM Studio, …) dapat membiarkan kunci API kosong. Jika penyedia mengembalikan info kemampuan yang tidak lengkap, Anda dapat memperbaiki Chat / Embedding secara manual di bawah.
it: Il test chiama l'endpoint dell'elenco modelli. I servizi locali (Ollama, LM Studio, …) possono lasciare vuota la chiave API. Se il provider restituisce informazioni incomplete sulle capacità, puoi correggere manualmente Chat / Embedding qui sotto.
ja: テストではモデル一覧エンドポイントを呼び出します。ローカルサービス（Ollama、LM Studio など）では API キーを空白のままにできます。プロバイダが不完全な機能情報を返す場合は、以下のチャット/埋め込みを手動で修正できます。
ko: 테스트는 모델 목록 엔드포인트를 호출합니다. 로컬 서비스(Ollama, LM Studio 등)는 API 키를 비워 둘 수 있습니다. 제공업체가 불완전한 기능 정보를 반환하는 경우 아래에서 채팅/임베딩을 수동으로 수정할 수 있습니다.
nl: Testen roept het model-lijst-eindpunt aan. Lokale services (Ollama, LM Studio, …) kunnen de API-sleutel leeg laten. Als de provider onvolledige mogelijkheidsinformatie retourneert, kunt u handmatig Chat / Embedding hieronder aanpassen.
pl: Testowanie wywołuje punkt końcowy listy modeli. Lokalne usługi (Ollama, LM Studio, …) mogą pozostawić klucz API pusty. Jeśli dostawca zwróci niekompletne informacje o możliwościach, możesz ręcznie poprawić Czat / Osadzanie poniżej.
pt_br: O teste chama o endpoint de lista de modelos. Serviços locais (Ollama, LM Studio, …) podem deixar a chave de API em branco. Se o provedor retornar informações de capacidade incompletas, você pode corrigir manualmente Chat / Embedding abaixo.
ru: Тестирование вызывает конечную точку списка моделей. Локальные сервисы (Ollama, LM Studio, …) могут оставить API-ключ пустым. Если провайдер возвращает неполную информацию о возможностях, вы можете вручную исправить Чат / Встраивание ниже.
tr: Test, model listesi uç noktasını çağırır. Yerel hizmetler (Ollama, LM Studio, …) API anahtarını boş bırakabilir. Sağlayıcı eksik yetenek bilgisi döndürürse, aşağıdan Sohbet / Yerleştirme'yi manuel olarak düzeltebilirsiniz.
uk: Тестування викликає кінцеву точку списку моделей. Локальні сервіси (Ollama, LM Studio, …) можуть залишити ключ API порожнім. Якщо провайдер повертає неповну інформацію про можливості, ви можете вручну виправити Chat / Embedding нижче.
vi: Kiểm tra gọi đến điểm cuối danh sách mô hình. Các dịch vụ cục bộ (Ollama, LM Studio, …) có thể để trống khóa API. Nếu nhà cung cấp trả về thông tin khả năng không đầy đủ, bạn có thể sửa thủ công Trò chuyện / Nhúng bên dưới.
zh_hans: 测试会调用模型列表接口；Ollama / LM Studio 等本地服务 API Key 可留空；如果服务商返回的模型能力不完整，可在下方手动修正 Chat / Embedding 类型。
zh_hant: 測試會調用模型列表接口；Ollama / LM Studio 等本地服務 API Key 可留空；如果服務商返回的模型能力不完整，可在下方手動修正 Chat / Embedding 類型。

# settings.ai.provider.sectionTitle
source: AI providers
ar: مزودو الذكاء الاصطناعي
de: KI-Anbieter
es: Proveedores de IA
fr: Fournisseurs IA
id: Penyedia AI
it: Provider AI
ja: AI プロバイダ
ko: AI 제공업체
pl: Dostawcy AI
pt_br: Provedores de IA
ru: AI-провайдеры
tr: AI sağlayıcıları
uk: AI-провайдери
vi: Nhà cung cấp AI
zh_hans: AI 服务商
zh_hant: AI 服務商

# settings.ai.provider.testButton
source: Test
ar: اختبار
de: Testen
es: Probar
fr: Tester
id: Uji
ja: テスト
ko: 테스트
pl: Testuj
pt_br: Testar
ru: Тест
uk: Тест
vi: Kiểm tra
zh_hans: 测试
zh_hant: 測試

# settings.ai.task.customModelLabel
source: Custom model
ar: نموذج مخصص
de: Benutzerdefiniertes Modell
es: Modelo personalizado
fr: Modèle personnalisé
id: Model kustom
it: Modello personalizzato
ja: カスタムモデル
ko: 사용자 정의 모델
nl: Aangepast model
pl: Model niestandardowy
pt_br: Modelo personalizado
ru: Пользовательская модель
tr: Özel model
uk: Користувацька модель
vi: Mô hình tùy chỉnh
zh_hans: 自定义模型
zh_hant: 自定義模型

# settings.ai.task.customModelPlaceholder
source: Custom model name
ar: اسم النموذج المخصص
de: Benutzerdefinierter Modellname
es: Nombre de modelo personalizado
fr: Nom du modèle personnalisé
id: Nama model kustom
it: Nome modello personalizzato
ja: カスタムモデル名
ko: 사용자 정의 모델 이름
nl: Aangepaste modelnaam
pl: Niestandardowa nazwa modelu
pt_br: Nome do modelo personalizado
ru: Название пользовательской модели
tr: Özel model adı
uk: Назва власної моделі
vi: Tên mô hình tùy chỉnh
zh_hans: 自定义模型名
zh_hant: 自定義模型名

# settings.ai.task.customToggle
source: Use custom model name
ar: استخدام اسم نموذج مخصص
de: Benutzerdefinierten Modellnamen verwenden
es: Usar nombre de modelo personalizado
fr: Utiliser un nom de modèle personnalisé
id: Gunakan nama model kustom
it: Usa nome modello personalizzato
ja: カスタムモデル名を使用
ko: 사용자 정의 모델 이름 사용
nl: Aangepaste modelnaam gebruiken
pl: Użyj niestandardowej nazwy modelu
pt_br: Usar nome de modelo personalizado
ru: Использовать пользовательскую модель
tr: Özel model adı kullan
uk: Використовувати власну назву моделі
vi: Sử dụng tên mô hình tùy chỉnh
zh_hans: 使用自定义模型名
zh_hant: 使用自定義模型名

# settings.ai.task.modelLabel
source: Model
ar: النموذج
de: Modell
es: Modelo
fr: Modèle
it: Modello
ja: モデル
ko: 모델
pt_br: Modelo
ru: Модель
uk: Модель
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

# settings.ai.task.noAvailableModel
source: (No available model — test and fetch models, or turn on Custom model)
ar: (لا يوجد نموذج متاح — اختبر النماذج وجلبها، أو فعّل النموذج المخصص)
de: (Kein verfügbares Modell – testen und Modelle abrufen oder benutzerdefiniertes Modell aktivieren)
es: (No hay modelo disponible: prueba y obtén modelos, o activa "Modelo personalizado")
fr: (Aucun modèle disponible — testez et récupérez les modèles, ou activez le modèle personnalisé)
id: (Tidak ada model tersedia — uji dan ambil model, atau aktifkan Model kustom)
it: (Nessun modello disponibile — testa e recupera modelli, o attiva Modello personalizzato)
ja: （利用可能なモデルがありません。テストしてモデルを取得するか、カスタムモデルをオンにしてください）
ko: (사용 가능한 모델 없음 — 모델을 테스트 및 가져오거나 사용자 정의 모델을 켜십시오)
nl: (Geen beschikbaar model — test en haal modellen op, of schakel 'Aangepast model' in)
pl: (Brak dostępnego modelu — przetestuj i pobierz modele lub włącz niestandardowy model)
pt_br: (Nenhum modelo disponível — teste e busque modelos, ou ative Modelo personalizado)
ru: (Нет доступной модели — протестируйте и получите модели или включите пользовательскую модель)
tr: (Kullanılabilir model yok — modelleri test edip getirin veya Özel modeli açın)
uk: (Немає доступної моделі — протестуйте та отримайте моделі, або увімкніть «Власна модель»)
vi: (Không có mô hình khả dụng — hãy kiểm tra và tải mô hình, hoặc bật Mô hình tùy chỉnh)
zh_hans: （无可用模型，请测试并获取模型，或开启「自定义模型」）
zh_hant: （無可用模型，請測試並獲取模型，或開啟「自定義模型」）

# settings.ai.task.pickerLabel
source: Task
ar: المهمة
de: Aufgabe
es: Tarea
fr: Tâche
id: Tugas
it: Attività
ja: タスク
ko: 작업
nl: Taak
pl: Zadanie
pt_br: Tarefa
ru: Задача
tr: Görev
uk: Завдання
vi: Tác vụ
zh_hans: 任务
zh_hant: 任務

# settings.ai.task.providerLabel
source: Provider
ar: المزوّد
de: Anbieter
es: Proveedor
fr: Fournisseur
id: Penyedia
it: Fornitore
ja: プロバイダ
ko: 제공자
pl: Dostawca
pt_br: Provedor
ru: Провайдер
tr: Sağlayıcı
uk: Постачальник
vi: Nhà cung cấp
zh_hans: 提供商
zh_hant: 提供商

# settings.ai.taskModels.title
source: Model assignments
ar: تعيينات النماذج
de: Modellzuweisungen
es: Asignaciones de modelo
fr: Affectations des modèles
id: Penugasan model
it: Assegnazioni modello
ja: モデル割り当て
ko: 모델 할당
nl: Modeltoewijzingen
pl: Przypisania modeli
pt_br: Atribuições de modelo
ru: Назначение моделей
tr: Model atamaları
uk: Призначення моделей
vi: Gán mô hình
zh_hans: 模型配置
zh_hant: 模型配置

# settings.ai.title
source: AI Service
ar: خدمة الذكاء الاصطناعي
de: KI-Dienst
es: Servicio de IA
fr: Service IA
id: Layanan AI
it: Servizio AI
ja: AI サービス
ko: AI 서비스
pl: Usługa AI
pt_br: Serviço de IA
ru: AI-сервис
tr: AI Hizmeti
uk: Служба ШІ
vi: Dịch vụ AI
zh_hans: AI 服务
zh_hant: AI 服務

# settings.aiIndex.advanced
source: Advanced thresholds
ar: عتبات متقدمة
de: Erweiterte Schwellenwerte
es: Umbrales avanzados
fr: Seuils avancés
id: Ambang lanjutan
it: Soglie avanzate
ja: 詳細しきい値
ko: 고급 임계값
nl: Geavanceerde drempels
pl: Zaawansowane progi
pt_br: Limiares avançados
ru: Расширенные пороги
tr: Gelişmiş eşikler
uk: Розширені пороги
vi: Ngưỡng nâng cao
zh_hans: 高级阈值
zh_hant: 高級閾值

# settings.aiIndex.advanced.lockedHint
source: Switch the preset to “Custom” to edit thresholds directly.
ar: بدّل الإعداد المسبق إلى "مخصص" لتعديل العتبات مباشرة.
de: Wechseln Sie zu „Benutzerdefiniert“, um Schwellenwerte direkt zu bearbeiten.
es: Cambia el ajuste preestablecido a "Personalizado" para editar los umbrales directamente.
fr: Passez le préréglage sur « Personnalisé » pour modifier les seuils directement.
id: Alihkan prasetel ke "Kustom" untuk mengedit ambang secara langsung.
it: Passa al preset "Personalizzato" per modificare direttamente le soglie.
ja: プリセットを「カスタム」に切り替えると、しきい値を直接編集できます。
ko: 임계값을 직접 편집하려면 사전 설정을 "사용자 정의"로 전환하십시오.
nl: Schakel de voorinstelling naar 'Aangepast' om drempels direct te bewerken.
pl: Przełącz ustawienie wstępne na „Niestandardowe”, aby edytować progi bezpośrednio.
pt_br: Mude a predefinição para "Personalizado" para editar os limiares diretamente.
ru: Переключите пресет на «Пользовательский», чтобы редактировать пороги напрямую.
tr: Eşikleri doğrudan düzenlemek için ön ayarı “Özel” olarak değiştirin.
uk: Перемкніть попередній набір на «Власний», щоб редагувати пороги безпосередньо.
vi: Chuyển chế độ cài đặt sang “Tùy chỉnh” để chỉnh sửa ngưỡng trực tiếp.
zh_hans: 切换到「自定义」后才能直接编辑阈值数字。
zh_hant: 切換到「自定義」後才能直接編輯閾值數字。

# settings.aiIndex.autoPrefetch
source: Auto background prefetch on launch
ar: جلب مسبق تلقائي في الخلفية عند التشغيل
de: Automatischer Hintergrundabruf beim Start
es: Precarga automática en segundo plano al iniciar
fr: Préchargement automatique en arrière-plan au lancement
id: Pengambilan latar belakang otomatis saat peluncuran
it: Prefetch automatico in background all'avvio
ja: 起動時に自動バックグラウンドプリフェッチ
ko: 실행 시 백그라운드에서 자동 미리 가져오기
nl: Automatisch vooraf ophalen op de achtergrond bij opstarten
pl: Automatyczne pobieranie w tle przy uruchomieniu
pt_br: Pré-busca automática em segundo plano ao iniciar
ru: Автофоновая предзагрузка при запуске
tr: Başlangıçta arka planda otomatik ön getirme
uk: Автоматичне попереднє завантаження у фоні при запуску
vi: Tự động tải trước nền khi khởi động
zh_hans: 启动时自动后台预拉
zh_hant: 啟動時自動後台預拉

# settings.aiIndex.bodyThreshold
source: Body diff ratio
ar: نسبة اختلاف النص الأساسي
de: Differenzverhältnis (Hauptteil)
es: Relación de diferencia del cuerpo
fr: Ratio de diff du corps
id: Rasio diff isi
it: Rapporto diff corpo
ja: 本文差分比率
ko: 본문 diff 비율
pl: Współczynnik różnicy treści
pt_br: Taxa de diferença do corpo
ru: Порог разницы тела
tr: Gövde fark oranı
uk: Коефіцієнт різниці тіла
vi: Tỷ lệ khác biệt nội dung
zh_hans: 主体差异比例
zh_hant: 主體差異比例

# settings.aiIndex.diffPreset.custom
source: Custom
ar: مخصص
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
id: Kustom
it: Personalizzato
ja: カスタム
ko: 사용자 정의
nl: Aangepast
pl: Niestandardowe
pt_br: Personalizado
ru: Пользовательский
tr: Özel
uk: Власний
vi: Tùy chỉnh
zh_hans: 自定义
zh_hant: 自定義

# settings.aiIndex.diffPreset.relaxed
source: Relaxed
ar: مريح
de: Großzügig
es: Relajado
fr: Relâché
id: Longgar
it: Rilassato
ja: 緩い
ko: 느슨함
nl: Ontspannen
pl: Luźne
pt_br: Relaxado
ru: Свободный
tr: Rahat
uk: Розслаблений
vi: Thoải mái
zh_hans: 宽松
zh_hant: 寬鬆

# settings.aiIndex.diffPreset.standard
source: Standard
ar: قياسي
es: Estándar
id: Standar
ja: 標準
ko: 표준
nl: Standaard
pl: Standardowe
pt_br: Padrão
ru: Стандартный
tr: Standart
uk: Стандартний
vi: Tiêu chuẩn
zh_hans: 标准
zh_hant: 標準

# settings.aiIndex.diffPreset.strict
source: Strict
ar: صارم
de: Streng
es: Estricto
id: Ketat
it: Stretto
ja: 厳格
ko: 엄격함
nl: Strikt
pl: Ścisłe
pt_br: Estrito
ru: Строгий
tr: Katı
uk: Суворий
vi: Nghiêm ngặt
zh_hans: 严格
zh_hant: 嚴格

# settings.aiIndex.notesThreshold
source: Notes diff ratio
ar: نسبة اختلاف الملاحظات
de: Differenzverhältnis (Notizen)
es: Relación de diferencia de notas
fr: Ratio de diff des notes
id: Rasio diff catatan
it: Rapporto diff note
ja: ノート差分比率
ko: 노트 diff 비율
nl: Notities-diffratio
pl: Współczynnik różnicy notatek
pt_br: Taxa de diferença das notas
ru: Порог разницы заметок
tr: Not fark oranı
uk: Коефіцієнт різниці нотаток
vi: Tỷ lệ khác biệt ghi chú
zh_hans: 笔记差异比例
zh_hant: 筆記差異比例

# settings.aiIndex.prefetch.alreadyUpToDateFmt
source: All up to date (%d repos)
ar: الكل محدث (%d مستودع)
de: Alle aktuell (%d Repos)
es: Todo actualizado (%d repos)
fr: Tout à jour (%d dépôts)
id: Semua terbaru (%d repositori)
it: Tutto aggiornato (%d repo)
ja: すべて最新です（%d リポジトリ）
ko: 모두 최신 상태 (%d개 저장소)
nl: Alles up-to-date (%d repos)
pl: Wszystko aktualne (%d repozytoriów)
pt_br: Tudo atualizado (%d repositórios)
ru: Всё актуально (%d репозиториев)
tr: Tümü güncel (%d depo)
uk: Все актуально (%d репозиторіїв)
vi: Tất cả đã cập nhật (%d kho lưu trữ)
zh_hans: 已是最新（共 %d 个仓库）
zh_hant: 已是最新（共 %d 個倉庫）

# settings.aiIndex.prefetch.completedFmt
source: Completed %d / %d
ar: اكتمل %d / %d
de: %d / %d abgeschlossen
es: Completado %d / %d
fr: Terminé %d / %d
id: Selesai %d / %d
it: Completato %d / %d
ja: 完了 %d / %d
ko: 완료 %d / %d
nl: Voltooid %d / %d
pl: Ukończono %d / %d
pt_br: Concluído %d / %d
ru: Завершено %d / %d
tr: Tamamlandı %d / %d
uk: Виконано %d / %d
vi: Đã hoàn thành %d / %d
zh_hans: 已完成 %d / %d
zh_hant: 已完成 %d / %d

# settings.aiIndex.prefetch.failedFmt
source: Failed: %@
ar: فشل: %@
de: Fehlgeschlagen: %@
es: Falló: %@
fr: Échec : %@
id: Gagal: %@
it: Fallito: %@
ja: 失敗: %@
ko: 실패: %@
nl: Mislukt: %@
pl: Niepowodzenie: %@
pt_br: Falhou: %@
ru: Ошибка: %@
tr: Başarısız: %@
uk: Помилка: %@
vi: Lỗi: %@
zh_hans: 失败：%@
zh_hant: 失敗：%@

# settings.aiIndex.prefetch.pause
source: Pause
ar: إيقاف مؤقت
es: Pausar
id: Jeda
it: Pausa
ja: 一時停止
ko: 일시 정지
nl: Pauzeren
pl: Wstrzymaj
pt_br: Pausar
ru: Пауза
tr: Duraklat
uk: Пауза
vi: Tạm dừng
zh_hans: 暂停
zh_hant: 暫停

# settings.aiIndex.prefetch.progressFmt
source: %d / %d (failures %d)
ar: %d / %d (فشل %d)
de: %d / %d (Fehler %d)
es: %d / %d (fallos %d)
fr: %d / %d (échecs %d)
id: %d / %d (gagal %d)
it: %d / %d (fallimenti %d)
ja: %d / %d（失敗 %d）
ko: %d / %d (실패 %d)
nl: %d / %d (mislukt %d)
pl: %d / %d (błędy %d)
pt_br: %d / %d (falhas %d)
ru: %d / %d (ошибок %d)
tr: %d / %d (başarısız %d)
uk: %d / %d (помилок %d)
vi: %d / %d (lỗi %d)
zh_hans: %d / %d（失败 %d）
zh_hant: %d / %d（失敗 %d）

# settings.aiIndex.prefetch.resume
source: Resume
ar: استئناف
de: Fortsetzen
es: Reanudar
fr: Reprendre
id: Lanjutkan
it: Riprendi
ja: 再開
ko: 재개
nl: Hervatten
pl: Wznów
pt_br: Retomar
ru: Возобновить
tr: Devam Et
uk: Продовжити
vi: Tiếp tục
zh_hans: 继续
zh_hant: 繼續

# settings.aiIndex.prefetch.start
source: Start prefetch
ar: بدء الجلب المسبق
de: Vorabruf starten
es: Iniciar precarga
fr: Démarrer le préchargement
id: Mulai pengambilan
it: Avvia prefetch
ja: プリフェッチを開始
ko: 미리 가져오기 시작
nl: Start vooraf ophalen
pl: Rozpocznij pobieranie
pt_br: Iniciar pré-busca
ru: Начать предзагрузку
tr: Ön getirmeyi başlat
uk: Почати попереднє завантаження
vi: Bắt đầu tải trước
zh_hans: 开始预拉
zh_hant: 開始預拉

# settings.aiIndex.preset
source: Rebuild threshold
ar: عتبة إعادة البناء
de: Neubauschwellenwert
es: Umbral de reconstrucción
fr: Seuil de reconstruction
id: Ambang pembangunan ulang
it: Soglia di ricostruzione
ja: 再構築しきい値
ko: 재구축 임계값
nl: Herbouwdrempel
pl: Próg przebudowy
pt_br: Limiar de reconstrução
ru: Порог перестроения
tr: Yeniden oluşturma eşiği
uk: Поріг перебудови
vi: Ngưỡng xây dựng lại
zh_hans: 重建阈值
zh_hant: 重建閾值

# settings.aiIndex.rebuildAll.button
source: Rebuild all vectors
ar: إعادة بناء جميع المتجهات
de: Alle Vektoren neu aufbauen
es: Reconstruir todos los vectores
fr: Reconstruire tous les vecteurs
id: Bangun ulang semua vektor
it: Ricostruisci tutti i vettori
ja: すべてのベクトルを再構築
ko: 모든 벡터 재구축
nl: Alle vectoren herbouwen
pl: Przebuduj wszystkie wektory
pt_br: Reconstruir todos os vetores
ru: Перестроить все векторы
tr: Tüm vektörleri yeniden oluştur
uk: Перебудувати всі вектори
vi: Xây dựng lại tất cả vector
zh_hans: 全量重建向量
zh_hant: 全量重建向量
